/**
 * Created by Administrator on 2017/6/12.
 */
var data = [];
var dataStr = "1、与君初相识<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
2、爱自拍<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
3、小公园也有乐趣<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
4、我们在天津<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
5、朋友圈你的第一张照片<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
6、我们在香港<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
7、哈哈，你的自拍<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
8、天津方特小冰宫<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
9、带我哥逛北京<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
10、天漠之行<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
11、520我爱你<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
12、遇见你很高兴<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
13、与你一起骑行北京的日子<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
14、美美的我<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
15、去西山<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
16、狂虐单身狗<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
17、大家一起去灵山<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
18、吃大餐吃大餐<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
19、情侣头像哈哈哈<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思. <br>\
<br>\
<br>\
20、帅帅的你<br>\
<br>\
与君初相识，<br>\
犹如故人归. <br>\
天涯明月新，<br>\
朝暮最相思.";
var d = dataStr.split("<br><br><br>");
console.log(d.length);
for(var i = 0; i < d.length; i++) {
    var c = d[i].split("<br><br>");
    data.push({
        img:c[0].replace('、', " ")+".jpg",
        caption:c[0].split("、")[1],
        desc:c[1]
    });
    console.log(c[0].replace("、", " ")+".jpg");
}